FactoryBot.define do
  factory :room do
    name { "example" }
    channel_id { "1234567890123456789" }
    channel_type { 'OM' }
    notice { "========공   지   필   독========



💙새로 오신 분들 반갑습니다.

※미성년자는 아쉽지만 나가주시면 감사하겠습니다.

⭐ 우측 상단의 줄3개 누르시고 ❤ 눌러주세요~❤
📍 프로필 설정 [닉네임 나이 성별 직군]으로 변경해주세요.
(-나이에 빠른년생 없습니다.)

📢  전체 공지사항  📢
1. 친목방인 만큼 적극적인 대화 혹은 벙 참여 부탁드립니다.
 (유령 강퇴 가능)
2. 일정시간내에 닉변을 하지않으면 강퇴합니다.
3. 욕설 및 불쾌감 주는 발언 경고없이 강퇴합니다.
4. 서로간에 호칭은 OO님으로 부탁드립니다.
5. 반말 사용 및 음슴체 자제 바랍니다.
6. 선구글링 후질문을 부탁드립니다.
7. 질문(과제 해결)만을 위한 참여는 사양합니다.
8. 입장과 동시에 질문(과제 해결)하는 인원은 위 7번 사항으로 합리적 의심을 할 수 있습니다.
9. 과다한 TMI 자제해주세요.
10. 사행성, 음란물, 구인글 등 홍보글이 올라오면 신고하여 주세요.
11. 타 오픈채팅방 언급 자제 및 공유 금지입니다.
12. 개인 SNS / 블로그 / 유튜브 공유 및 홍보 금지입니다.
13. 타인에 인한 실명 언급 금지입니다.
14. 어그로 및 정치질 금지입니다.
15. 불법 프로그램 관련 질문 금지 및 신고해 주세요.
16. 방장 및 쨘님을 제외한 인원 프로필 톡 금지입니다.

⚜ 불편 사항이나 기타 의견이 있을 시, 방장 또는 부방장 프로필에 1:1 채팅을 신청해주세요 ⚜

💡방장의 부탁💡
📢 질문 > 응답 > 감사는 표현해주시면 좋은 기본 에티켓이라고 생각합니다 :)
깨끗한 IT대나무숲이 되길 함께 해주세요." }
  end
end
